---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RisersAtSameLocation
source: html/f0426cc6-c6be-989c-a028-30cecb8ec0e4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RisersAtSameLocation Property

The highlighted risers have the same location along the boundary line. Please move one of the two risers.

## Syntax (C#)
```csharp
public static FailureDefinitionId RisersAtSameLocation { get; }
```